[M_EternalFlame MissionDefinition]
MissionDescription="Lilith has asked you to infiltrate a clan of cultists who worship her as a goddess. As far as Lilith's concerned, this could be awesome, creepy, or both -- she's asked you to investigate the clan from the inside to see if they're up to anything creepy. You'll have to speak to the cult leader, Incinerator Clayton, to become a cultist."

[M_EternalFlame:Collect5BanditAshesSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lilith has asked you to infiltrate a clan of cultists who worship her as a goddess. The clan's leader, Incinerator Clayton, has asked you to burn some of his fellow Incinerators alive with a fire weapon and collect their ashes. Once you've done this, you will be an official member of the Incinerators."

[M_LightingTheMatch MissionDefinition]
TurnInDescription="Matchstick is deep within the warm confines of the Firehawk's embrace, experiencing a supreme, eternal bliss.<br><br>Or he's in hell."

[M_TheEnkindling MissionDefinition]
MissionDescription="Lilith is relatively sure that the Children of the Firehawk are harmless, but she wants you to investigate this whole ''Enkindling'' thing before you let the cult off the hook entirely."
